{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Technology",
      "department": "Electronics and Communication Engineering",
      "duration": "2013-2017",
      "school_name": "Jawaharlal Nehru Technological University, Hyderabad"
    },
    {
      "awards_achievements": null,
      "degree": "Post Graduate Certificate",
      "department": "Electronics and Embedded Systems Development",
      "duration": "2018-2019",
      "school_name": "Fanshawe College"
    },
    {
      "awards_achievements": [
        "President's Honour Roll",
        "GPA: 4.18/4.2"
      ],
      "degree": "Post Graduate Certificate",
      "department": "Geographic Information Systems",
      "duration": "2019-2020",
      "school_name": "Fanshawe College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_PrateekAnnaiahgari",
  "highlighted_projects": [
    {
      "description": "Developed a Web application using ASP.NET that uses stored procedures to access UFO data stored in MSSQL server to produce the location map of UFOs on Google maps. Utilizes Google maps API to produce cluster maps and graphic icon maps of UFO sighting locations all around the world.",
      "name": "Web app Tracking UFO Sightings"
    },
    {
      "description": "Developed a WPF application that can calculate Flight routes based on the selected Waypoints. Implemented in C# and gathers Globlal airports data stored in MSSQL Server using Stored procedures.",
      "name": "Flight Computer"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux Cluster Monitoring agent to log hardware specifications, and the resource usage of each node in the Linux cluster of 10 nodes, running on CentOS7. The agent uses two srcipts onr for host info and the other for host usage. The scripts send the data to PostGreSQL databse running on Docker. The usage data is collected every minute using Crontab. The collected data can be queried using SQL to answer specific resource usage questions.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Twitter CLI tool, using Java 8 and Twitter REST API that allows users to access their Twitter account. Provides basic operations like Post, Show and Delete tweets. Managed dependencies using Springboot. Implemented using DAO design pattern and, built and packaged using Maven. Tested the app using JUnit4 and Mockito. Deployed using Docker on Dockerhub.",
        "JDBC App: Created a JDBC application that leverages the JDBC driver APIs to connect to PostgrsSQL database. Implemented using a DAO design pattern and, built and packaged using Maven. Deployed using Docker on Dockerhub.",
        "Grep App: Implemented a grep app in java that searches for a text pattern recursively in a given directory, similar to the linux's GREP command.  Built and packaged using Maven and deployed using Docker on Dockerhub."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a proof-of-concept trading application in java that uses microservice architecture to replace Jarvis's exisiting monolithic application. Provides features for users to manage trading accounts, pull and post market data. Managed using Maven and Springboot. Database connectivity using DataSource and JDBC APIs. Tested the app using Junit4 integration tests. Deployed as web servlet with SwaggerUI and Apache Tomcat using docker on Dockerhub.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Currently in progress!",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Not Started",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not Started",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not Started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Sai Prateek Reddy Annaiahgari",
  "others": [
    {
      "bullets": [
        "Scala \u0026 Functional Programming for Beginners by Daniel Ciocirlan on Udemy",
        "Funtional Programming principles in Scala by Martin Odersky, EPFL on Coursera",
        "Spark 3.0 \u0026 Big Data Essentials with Scala by Daniel Ciocirlan on Udemy",
        "Modern Big Data Analysis with SQL Specialization by Cloudera on Coursera",
        "Using Python to access web data by University of Michigan on Coursera",
        "Python Data Structures by University of Michigan on Coursera",
        "Linux Shell Scripting: A Project-Based Approach to Learning by Jason Cannon on Udemy"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Basketball player",
        "Playing mutiplayer online battle video games",
        "Hiking",
        "Cycling"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in an Agile/Scrum team and developed various Software projects. The projects were implemented using various tools and technologies like Linux, Java, Springboot, Docker, PostgreSql, Git and GCP.",
      "duration": "2021-present",
      "title": "Data Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Scala",
      "Apache Spark",
      "Maven",
      "Springboot",
      "HTML/CSS",
      "C#",
      "REST API",
      "Docker"
    ],
    "familiar": [
      "Cloud Platforms - GCP and AWS",
      "Kubernetes",
      "Apache Kafka",
      "Apache Hive",
      "Apache Impala"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "python"
    ]
  },
  "summary": "I am a gradute of Electronics and Communication Engineering program with a specialization in Embedded Systems from Jawaharlal Nehru Technological Univarsity, Hyderabad, India. With a strong foundation in basic programming principles and analytical skills, I decided to explore the concepts of software engineering and expand my technical knowledge to pursue a career in Software Development. I have utilized various free online resources to learn different programming languages like python, C#, Java and Scala, and various tools by Apache Software Foundation. The improved knowledge helped me secure a job at Jarvis as a Data Engineer. At Jarvis, I learned to work as a team in a dynamic environment and develop efficient sofware solutions to complex real-world business problems. As a result of my abilty to quickly learn new technologies in a dynamic field like Data engineering, I will be a great fit to an equally dynamic team and organisation as a Data Engineer."
}
